//========================================================= Узел односвязного списка (обобщённый) ================================================================//
namespace WorkPracticeLauncher.Models
{
	public class Node<T>
	{
		//========================================================= Поля и свойства ================================================================//
		public T Data { get; set; }                             // Данные, хранящиеся в узле
		public Node<T> Next { get; set; }                       // Ссылка на следующий узел

		//========================================================= Конструктор ================================================================//
		public Node(T data) => Data = data;                     // При создании узла сохраняем данные, Next по умолчанию null
	}
}
