//================================================================== Модель товара для консольного задания 2 ===================================================================================//
namespace WorkPracticeLauncher.Models
{
	public class Product
	{
		//===================================================================== Свойства =======================================================================================================//
		public string Name { get; set; }                // Наименование товара
		public string Manufacturer { get; set; }        // Фирма-изготовитель
		public int ShelfLife { get; set; }              // Срок хранения в днях
		public decimal Price { get; set; }              // Цена товара
		public int StockQuantity { get; set; }          // Количество на складе
	}
}
