//========================================================= Библиотеки ================================================================//
using System.Windows;              // Базовые WPF-классы (Window, Application)

namespace Work_Practice.Views       // Пространство имён для окон и представлений
{
	//========================================================= Класс главного окна приложения ================================================================//
	public partial class MainWindow : Window
	{
		//========================================================= Конструктор окна ================================================================//
		public MainWindow()
		{
			InitializeComponent();                              // Инициализируем XAML-компоненты (загружаем разметку)
			this.Loaded += (s, e) => Helpers.WindowButtonHelper.Attach(this); // При загрузке окна подключаем кастомные кнопки управления (свернуть, развернуть, закрыть)
		}
	}
}
